package homework5.task3;

public interface Dish {

    public void getDescription();

    public void addDish();

/*
    Условие:
    В меню ресторана добавляется блюдо.
    У каждого блюда свои параметры отображения:
    Горячее блюдо — с температурой
    Напиток — с объёмом
    Нужно спроектировать систему, в которой можно добавлять блюда
    и выводить их описание с учётом характеристик.

    Подсказка:
    Интерфейс или абстрактный класс Dish с методом getDescription()
    Классы HotDish и Drink с полями temperature / volume
    Меню может быть классом, хранящим список Dish
    Используй интерфейсы и коллекции
*/

}
